; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=48, remove_proportion=0.2, bases=9, instance_id=30, output=./training, seed=71

(define (problem warehouse-30)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 box48 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 - base
    )
    (:init
        (to-remove box1)
        (to-remove box6)
        (to-remove box10)
        (to-remove box13)
        (to-remove box17)
        (to-remove box21)
        (to-remove box33)
        (to-remove box40)
        (to-remove box44)
        (clear box31)
        (on box31 box15)
        (on box15 box3)
        (on box3 box36)
        (on box36 box23)
        (on box23 box13)
        (on box13 box6)
        (on-base box6 base1)
        (clear box48)
        (on box48 box22)
        (on box22 box37)
        (on box37 box38)
        (on box38 box40)
        (on-base box40 base2)
        (clear box12)
        (on box12 box10)
        (on box10 box25)
        (on box25 box18)
        (on box18 box26)
        (on box26 box42)
        (on-base box42 base3)
        (clear box39)
        (on box39 box17)
        (on box17 box27)
        (on box27 box24)
        (on box24 box34)
        (on box34 box4)
        (on box4 box1)
        (on-base box1 base4)
        (clear box41)
        (on box41 box30)
        (on box30 box47)
        (on box47 box32)
        (on-base box32 base5)
        (clear box11)
        (on box11 box14)
        (on box14 box46)
        (on box46 box33)
        (on box33 box29)
        (on box29 box19)
        (on box19 box8)
        (on-base box8 base6)
        (clear box35)
        (on box35 box20)
        (on box20 box43)
        (on box43 box16)
        (on-base box16 base7)
        (clear box9)
        (on box9 box45)
        (on box45 box21)
        (on box21 box44)
        (on-base box44 base8)
        (clear box2)
        (on box2 box28)
        (on box28 box5)
        (on box5 box7)
        (on-base box7 base9)
    )
    (:goal (and 
        (removed box1)
        (removed box6)
        (removed box10)
        (removed box13)
        (removed box17)
        (removed box21)
        (removed box33)
        (removed box40)
        (removed box44)
    ))
)

; plan
1. (move box11 box14 box2)
   deleted: (clear box2) (on box11 box14)
   added: (on box11 box2) (clear box14)
   goals met: 0 of 9
2. (move box12 box10 box11)
   deleted: (clear box11) (on box12 box10)
   added: (on box12 box11) (clear box10)
   goals met: 0 of 9
3. (remove box10 box25)
   deleted: (on box10 box25) (clear box10)
   added: (removed box10) (clear box25)
   goals met: 1 of 9
4. (move box14 box46 box12)
   deleted: (clear box12) (on box14 box46)
   added: (on box14 box12) (clear box46)
   goals met: 1 of 9
5. (move box31 box15 box14)
   deleted: (clear box14) (on box31 box15)
   added: (on box31 box14) (clear box15)
   goals met: 1 of 9
6. (move box15 box3 box25)
   deleted: (clear box25) (on box15 box3)
   added: (on box15 box25) (clear box3)
   goals met: 1 of 9
7. (move box3 box36 box15)
   deleted: (clear box15) (on box3 box36)
   added: (on box3 box15) (clear box36)
   goals met: 1 of 9
8. (move box36 box23 box3)
   deleted: (clear box3) (on box36 box23)
   added: (on box36 box3) (clear box23)
   goals met: 1 of 9
9. (move box23 box13 box31)
   deleted: (clear box31) (on box23 box13)
   added: (on box23 box31) (clear box13)
   goals met: 1 of 9
10. (remove box13 box6)
   deleted: (on box13 box6) (clear box13)
   added: (removed box13) (clear box6)
   goals met: 2 of 9
11. (move box39 box17 box23)
   deleted: (clear box23) (on box39 box17)
   added: (on box39 box23) (clear box17)
   goals met: 2 of 9
12. (remove box17 box27)
   deleted: (on box17 box27) (clear box17)
   added: (removed box17) (clear box27)
   goals met: 3 of 9
13. (move box27 box24 box35)
   deleted: (clear box35) (on box27 box24)
   added: (on box27 box35) (clear box24)
   goals met: 3 of 9
14. (move box24 box34 box27)
   deleted: (clear box27) (on box24 box34)
   added: (on box24 box27) (clear box34)
   goals met: 3 of 9
15. (move box34 box4 box24)
   deleted: (clear box24) (on box34 box4)
   added: (on box34 box24) (clear box4)
   goals met: 3 of 9
16. (move box4 box1 box34)
   deleted: (clear box34) (on box4 box1)
   added: (on box4 box34) (clear box1)
   goals met: 3 of 9
17. (remove-from-base box1 base4)
   deleted: (on-base box1 base4) (clear box1)
   added: (removed box1) (clear-base base4)
   goals met: 4 of 9
18. (move box46 box33 box36)
   deleted: (clear box36) (on box46 box33)
   added: (on box46 box36) (clear box33)
   goals met: 4 of 9
19. (remove box33 box29)
   deleted: (on box33 box29) (clear box33)
   added: (removed box33) (clear box29)
   goals met: 5 of 9
20. (move box48 box22 box29)
   deleted: (clear box29) (on box48 box22)
   added: (on box48 box29) (clear box22)
   goals met: 5 of 9
21. (move box22 box37 box39)
   deleted: (clear box39) (on box22 box37)
   added: (on box22 box39) (clear box37)
   goals met: 5 of 9
22. (move box37 box38 box22)
   deleted: (clear box22) (on box37 box38)
   added: (on box37 box22) (clear box38)
   goals met: 5 of 9
23. (move box38 box40 box37)
   deleted: (clear box37) (on box38 box40)
   added: (on box38 box37) (clear box40)
   goals met: 5 of 9
24. (move box9 box45 box38)
   deleted: (clear box38) (on box9 box45)
   added: (on box9 box38) (clear box45)
   goals met: 5 of 9
25. (move box45 box21 box4)
   deleted: (clear box4) (on box45 box21)
   added: (on box45 box4) (clear box21)
   goals met: 5 of 9
26. (remove box21 box44)
   deleted: (on box21 box44) (clear box21)
   added: (removed box21) (clear box44)
   goals met: 6 of 9
27. (remove-from-base box40 base2)
   deleted: (on-base box40 base2) (clear box40)
   added: (removed box40) (clear-base base2)
   goals met: 7 of 9
28. (remove-from-base box44 base8)
   deleted: (on-base box44 base8) (clear box44)
   added: (removed box44) (clear-base base8)
   goals met: 8 of 9
29. (remove-from-base box6 base1)
   deleted: (on-base box6 base1) (clear box6)
   added: (removed box6) (clear-base base1)
   goals met: 9 of 9
